rickywu0421/freebsd-src/usr.sbin/wtapctl/wtapctl.8
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2023 The FreeBSD Foundation
.\"
.\" This software was developed by En-Wei Wu under sponsorship from 
.\" the FreeBSD Foundation.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions 
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright 
.\"	 notice, this list of conditions and the following disclaimer. 
.\" 2. Redistributions in binary form must reproduce the above copyright 
.\"	 notice, this list of conditions and the following disclaimer in the 
.\"	 documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF 
.\" SUCH DAMAGE
.\"
.Dd January 6, 2023
.Dt WTAPCTL 8
.Os
.Sh NAME
.Nm wtapctl
.Nd "configure wtap device parameters"
.Sh SYNOPSIS
.Nm
.Cm device Cm create Op Ar id
.Pp
.Nm
.Cm device Cm delete Ar id
.Pp
.Nm
.Cm device Cm delete Cm list
.Pp
.Nm
.Cm vis Op Cm open | Cm close
.Pp
.Nm
.Cm vis Op Cm add | delete 
.Ar id_from Ar id_to
.Pp
.Nm
.Cm vis Cm show Ar id
.Sh DESCRIPTION
The 
.Nm
utility controls two aspects of the wtap system: 
device manipulation and visibility control. 
.Pp
The device manipulation function allows users to 
create and delete wtap devices, and once a device is created, 
users can use 
.Xr ifconfig 8 
to create network interfaces on top of the wtap device.
.Pp
The visibility control function manages the 
visibility of the wtap devices.
.Sh EXAMPLES
For example, create two wtap devices, and allow them to transmit 
packets to each other :
.Pp
.Dl # wtapctl device create 0
.Pp
.Dl # wtapctl device create 1
.Pp
.Dl # wtapctl vis add 0 1
.Pp
.Dl # wtapctl vis add 1 0
.Pp
Show the list of wtap devices:
.Pp
.Dl # wtapctl device list
.Pp
Check the devices wtap0 can reach:
.Pp
.Dl # wtapctl vis show 0
.El
.Sh SEE ALSO
.Xr ifconfig 8 ,
.Xr net80211 4 ,
.Xr ieee80211 9 ,
.Xr wlan 4
.Sh HISTORY
The
.Nm
utility first appeared in FreeBSD 14.0.
